; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph1 - mode
	infrared0 - mode
	infrared2 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	Star1 - direction
	Star3 - direction
	Star6 - direction
	Star4 - direction
	Star0 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 infrared0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 infrared0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 infrared0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star6)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
)
(:goal (and
	(pointing satellite1 Star10)
	(pointing satellite3 Phenomenon9)
	(have_image Planet7 infrared0)
	(have_image Phenomenon8 infrared2)
	(have_image Phenomenon9 infrared0)
	(have_image Star10 infrared0)
	(have_image Star11 spectrograph1)
	(have_image Star12 spectrograph1)
))

)

; plan
1. (turn_to satellite3 phenomenon9 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 phenomenon9)
   goals met: 1 of 8
2. (turn_to satellite2 star4 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star4)
   goals met: 1 of 8
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 8
4. (calibrate satellite2 instrument5 star4)
   added: (calibrated instrument5)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon9 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 8
6. (take_image satellite2 phenomenon9 instrument5 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon8)
   goals met: 2 of 8
8. (turn_to satellite1 star10 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star10)
   goals met: 3 of 8
9. (take_image satellite2 phenomenon8 instrument5 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 4 of 8
10. (turn_to satellite2 planet7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet7)
   goals met: 4 of 8
11. (take_image satellite2 planet7 instrument5 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 5 of 8
12. (turn_to satellite2 star10 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star10)
   goals met: 5 of 8
13. (take_image satellite2 star10 instrument5 infrared0)
   added: (have_image star10 infrared0)
   goals met: 6 of 8
14. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 6 of 8
15. (take_image satellite2 star11 instrument5 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 7 of 8
16. (turn_to satellite2 star12 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star12)
   goals met: 7 of 8
17. (take_image satellite2 star12 instrument5 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 8 of 8
